example-scripts/bash-scripts/full-harvest-examples/1.0-1.5-examples/example-wos/wos-authenticate-message.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:ns2="http://auth.cxf.wokmws.thomsonreuters.com">
	<soap:Body>
		<ns2:authenticate/>
	</soap:Body>
</soap:Envelope>
